# Naive Bayes theorem

Naive bayes theorm uses bayes theorm for conditional probability with a naive assumption that 
the features are not correlated to each other and tries to find conditional probability of target variable 
given the probabilities of features. We will use titanic survival dataset here and using naive bayes classifier 
find out the survival probability of titanic travellers. 
We use sklearn library and python for this beginners machine learning tutorial.
GaussianNB is the classifier we use to train our model. There are other classifiers such as MultinomialNB 
but we will use that in part 2 of the tutorial.

In [2]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
#EXPLORATORY DATA ANALYSIS

df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns', inplace = True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df.Survived                             
inputs = df.drop('Survived', axis ='columns')

In [5]:
#in sex, the values are in text format. with onehot encoding, we'll convert into numeric format.

dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs = pd.concat([inputs,dummies], axis = 'columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop('Sex', axis = 'columns', inplace = True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [8]:
#to know NA values in the above table

inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(inputs, target, test_size= 0.2)

In [12]:
len(X_train)

712

In [13]:
len(X_test)

179

In [14]:
len(inputs)

891

In [15]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [16]:
model.fit(X_train, Y_train)

GaussianNB()

In [17]:
model.score(X_test, Y_test)

0.8100558659217877

In [18]:
X_test[:10]

     Pclass        Age     Fare  female  male
78        2   0.830000  29.0000       0     1
538       3  29.699118  14.5000       0     1
867       1  31.000000  50.4958       0     1
586       2  47.000000  15.0000       0     1
768       3  29.699118  24.1500       0     1
475       1  29.699118  52.0000       0     1
589       3  29.699118   8.0500       0     1
630       1  80.000000  30.0000       0     1
57        3  28.500000   7.2292       0     1
854       2  44.000000  26.0000       1     0

In [19]:
Y_test[:10]

78     1
538    0
867    0
586    0
768    0
475    0
589    0
630    1
57     0
854    0
Name: Survived, dtype: int64

In [20]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 1], dtype=int64)

In [21]:
model.predict_proba(X_test[:10])

array([[0.93704203, 0.06295797],
       [0.98677712, 0.01322288],
       [0.83942042, 0.16057958],
       [0.97058772, 0.02941228],
       [0.98584955, 0.01415045],
       [0.83344037, 0.16655963],
       [0.98706261, 0.01293739],
       [0.76952472, 0.23047528],
       [0.98693269, 0.01306731],
       [0.02798683, 0.97201317]])